#ifndef __PROTOCOL_DEF_H__
#define __PROTOCOL_DEF_H__


#include "protocol.h"
//---------------------------------------------------------------------------
//	操作类型定义 共9种
//	28位至21位，共8位一个字节，说明消息操作类型，最多可以表示9种类型
//	0000 1111 1111 0000 0000 0000 0000 0000
//---------------------------------------------------------------------------
#define MSGID_REQ					0x00000000		//请求消息类型
#define MSGID_ACK					0x02000000		//应答消息类型
#define MSGID_NTF					0x04000000		//通知消息

//---------------------------------------------------------------------------
//	标准网络通信头字段使用定义
//---------------------------------------------------------------------------
//	dwType 32位4字节格式使用定义
//---------------------------------------------------------------------------
//	版本号定义1~16
//	32位至29位，共4位半个字节，说明消息版本号，从0开始共可表示16个版本
//	1111 0000 0000 0000 0000 0000 0000 0000
//---------------------------------------------------------------------------

//	消息基础值定义
#define MSGID_BASE_SVRD_INSIDE  0x00000400      // 服务内部通信
#define	MSGID_BASE_GS_GAMEINFO	0x00000500		// gamesvrd和gameinfo交互
#define	MSGID_BASE_GS_WEB		0x00000600		// gamesvrd和web交互
#define	MSGID_BASE_GS_MANAGER	0x00000700		// gamesvrd和manager交互
#define MSGID_BASE_GS_AI		0x00000800		// gamesvrd和ai交互
#define MSGID_BASE_GS_RM        0x00000900      // 同roomsvrd 交互
#define	MSGID_BASE_GS_CLIENT	0x00010000		// gamesvrd和client交互

#endif
